---
type: PhotometricWebLightDistribution
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# PhotometricWebLightDistribution

`Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PhotometricWebLightDistribution | — | `` |
| Property | PhotometricWebFile | 2013 | `public string PhotometricWebFile { get ; set ; }` |
| Property | TiltAngle | 2013 | `public double TiltAngle { get ; set ; }` |